In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
PATH_TO_DATA = 'E:/Edureka_Python-Course/Data Sources/Day_4/'

In [9]:
df_raw = pd.read_csv(PATH_TO_DATA+'emp_78fn7.csv', low_memory=False)
df_raw

   eid   name  salary location
0    1   Amit   12000       CA
1    2  Allen   15000       NY
2    3  Kathy   18000       CA

In [12]:
df_raw[df_raw['salary'] > 15000]

   eid   name  salary location
2    3  Kathy   18000       CA

In [13]:
df_raw[df_raw['location'] == 'CA']

   eid   name  salary location
0    1   Amit   12000       CA
2    3  Kathy   18000       CA

In [34]:
cond = [True if (i[0] == 'A') else False for i in df_raw['name']]
df_raw[cond]

   eid   name  salary location
0    1   Amit   12000       CA
1    2  Allen   15000       NY